; domain
(define (domain kitchen-line)
  (:requirements :strips :typing)
  (:types chef recipe utensil garnish)
  (:predicates
  (carries ?i - utensil ?s - chef)
  (prepares ?i - utensil ?m - garnish)
  (focused_on ?s - chef ?d - recipe)
  (energy_spare ?s - chef)
  (energy_active ?i - utensil)
  (sharpened ?i - utensil)
  (have_dish ?d - recipe ?m - garnish)
  (sharpening_recipe ?i - utensil ?d - recipe))

  (:action switch_focus
   :parameters (?s - chef ?d_new - recipe ?d_prev - recipe)
   :precondition (and (focused_on ?s ?d_prev))
   :effect (and  (focused_on ?s ?d_new)
                 (not (focused_on ?s ?d_prev))))

  (:action fire_up
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_spare ?s))
   :effect (and (energy_active ?i)
                (not (sharpened ?i))
                (not (energy_spare ?s))))

  (:action cool_down
   :parameters (?i - utensil ?s - chef)
   :precondition (and (carries ?i ?s)
                      (energy_active ?i))
   :effect (and (not (energy_active ?i))
                (energy_spare ?s)))

  (:action sharpen
   :parameters (?s - chef ?i - utensil ?d - recipe)
   :precondition (and (carries ?i ?s)
          (sharpening_recipe ?i ?d)
                      (focused_on ?s ?d)
                      (energy_active ?i))
   :effect (sharpened ?i))

  (:action plate_dish
   :parameters (?s - chef ?d - recipe ?i - utensil ?m - garnish)
   :precondition (and (sharpened ?i)
                      (carries ?i ?s)
                      (prepares ?i ?m)
                      (energy_active ?i)
                      (focused_on ?s ?d))
   :effect (have_dish ?d ?m)))

; problem
(define (problem kitchen-line-p01)
(:domain kitchen-line)
(:objects
  chef0 - chef
  utensil0 - utensil
  chef1 - chef
  utensil1 - utensil
  chef2 - chef
  utensil2 - utensil
  broiler0 - garnish
  pantry0 - recipe
  dessert1 - recipe
)
(:init
  (prepares utensil0 broiler0)
  (sharpening_recipe utensil0 pantry0)
  (carries utensil0 chef0)
  (energy_spare chef0)
  (focused_on chef0 dessert1)
  (prepares utensil1 broiler0)
  (sharpening_recipe utensil1 pantry0)
  (carries utensil1 chef1)
  (energy_spare chef1)
  (focused_on chef1 dessert1)
  (prepares utensil2 broiler0)
  (sharpening_recipe utensil2 pantry0)
  (carries utensil2 chef2)
  (energy_spare chef2)
  (focused_on chef2 pantry0)
)
(:goal (and
  (focused_on chef1 pantry0)
  (focused_on chef2 pantry0)
  (have_dish dessert1 broiler0)
))

)

; plan
1. (fire_up utensil2 chef2)
   deleted: (energy_spare chef2)
   added: (energy_active utensil2)
   goals met: 1 of 3
2. (sharpen chef2 utensil2 pantry0)
   added: (sharpened utensil2)
   goals met: 1 of 3
3. (switch_focus chef1 pantry0 dessert1)
   deleted: (focused_on chef1 dessert1)
   added: (focused_on chef1 pantry0)
   goals met: 2 of 3
4. (switch_focus chef2 dessert1 pantry0)
   deleted: (focused_on chef2 pantry0)
   added: (focused_on chef2 dessert1)
   goals met: 1 of 3
5. (plate_dish chef2 dessert1 utensil2 broiler0)
   added: (have_dish dessert1 broiler0)
   goals met: 2 of 3
6. (switch_focus chef2 pantry0 dessert1)
   deleted: (focused_on chef2 dessert1)
   added: (focused_on chef2 pantry0)
   goals met: 3 of 3
